Tekla Open API Reference for Tekla Structures 2025
IObjectAlignedBoundingBox Methods
The IObjectAlignedBoundingBox type exposes the following members.
Methods
Name | Description
GetObjectAlignedBoundingBox
 Gets the bounding box for the current object in its local coordinate system.
Top
See Also
Reference
IObjectAlignedBoundingBox Interface
Tekla.Structures.Drawing Namespace